Classes | Functions
Cutting Plane Management
Functions related to Cutting Planes and cutaways. More...
 Classes
class  | ACAPI::Cutaway::v1::CuttingPlane
CuttingPlane if the representation of the cutting plane settings. More...
struct  | ACAPI::Cutaway::v1::API_CutPolygonInfo
Information regarding cut polygons. More...
 Functions
ACAPI::Result< bool >  | ACAPI::Cutaway::v1::CuttingPlane::Is3DCutawayEnabled () const
ACAPI::Result< void >  | ACAPI::Cutaway::v1::CuttingPlane::Set3DCutawayStatus (bool status) const
ACAPI::Result< bool >  | ACAPI::Cutaway::v1::CuttingPlane::AreCuttingPlanesVisible () const
ACAPI::Result< void >  | ACAPI::Cutaway::v1::CuttingPlane::SetCuttingPlanesVisibility (bool visible) const
ACAPI::Result< CuttingPlane >  | ACAPI::Cutaway::v1::GetCuttingPlane ()
Detailed Description
Functions related to Cutting Planes and cutaways.
Function Documentation
◆ AreCuttingPlanesVisible()
 ACAPI::Result< bool > ACAPI::Cutaway::v1::CuttingPlane::AreCuttingPlanesVisible  |  ( |   | ) |   const
Returns
Returns whether the Cutting Planes are visible.
◆ GetCuttingPlane()
 ACAPI::Result< CuttingPlane > ACAPI::Cutaway::v1::GetCuttingPlane  |  ( |   | )
inline
Returns
Gets the entity representing the cutting plane.
◆ Is3DCutawayEnabled()
 ACAPI::Result< bool > ACAPI::Cutaway::v1::CuttingPlane::Is3DCutawayEnabled  |  ( |   | ) |   const
Returns
Returns whether the 3D Cutaway is enabled.
◆ Set3DCutawayStatus()
 ACAPI::Result< void > ACAPI::Cutaway::v1::CuttingPlane::Set3DCutawayStatus  |  ( |  bool  |  status | ) |   const
Parameters
status | True if the Cutaway should be enabled, false if it should be disabled.
Returns
Turns the 3D Cutaway on/off.
◆ SetCuttingPlanesVisibility()
 ACAPI::Result< void > ACAPI::Cutaway::v1::CuttingPlane::SetCuttingPlanesVisibility  |  ( |  bool  |  visible | ) |   const
Parameters
visible | True if the Cutting Planes should be visible, false if not.
Returns
Shows or hides the Cutting Planes.